# Parameters
nc: 80  # number of classes
scales: 
# [depth, width, max_channels]
n: [0.33, 0.25, 1024]
s: [0.33, 0.50, 1024]
m: [0.67, 0.75, 768]
l: [1.00, 1.00, 512]
x: [1.00, 1.25, 512]

# DKA-YOLO.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, LDKA_C2f, [128, 13, True]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, LDKA_C2f, [256, 13, True]]  # 4
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, LDKA_C2f, [512, 13, True]]  # 6
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, LDKA_C2f, [1024, 13, True]]  # 8
  - [-1, 1, SPPF, [1024, 5]]  # 9

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 10
  - [[-1, 6], 1, Concat, [1]]  # 11
  - [-1, 3, MDKA_C2f, [512, True]]  # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 13
  - [[-1, 4], 1, Concat, [1]]  # 14
  - [-1, 3, MDKA_C2f, [256, True]]  # 15

  - [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ]  # 16
  - [ [ -1, 2 ], 1, Concat, [1]]  # 17
  - [ -1, 3, MDKA_C2f, [128, True]]  # 18 (very small)

  - [-1, 1, Conv, [128, 3, 2]]  # 19
  - [[-1, 15], 1, Concat, [1]]  # 20
  - [-1, 3, MDKA_C2f, [256, True]]  # 21  (small)

  - [-1, 1, Conv, [256, 3, 2]]  # 22
  - [[-1, 12], 1, Concat, [1]]  # 23
  - [-1, 3, MDKA_C2f, [512, True]]  # 24  (medium)

  - [ -1, 1, Conv, [ 512, 3, 2 ] ]  # 25
  - [ [ -1, 9], 1, Concat, [1]]  # 26
  - [ -1, 3, MDKA_C2f, [1024, True]]  # 27  (large)

  - [[18, 21, 24, 27], 1, MSK_Detect_Head, [nc]]
